In [1]:
# pandas group by
import pandas as pd

In [3]:
data = {
    "Companies": ["Bmw", "Ferrari", "Tata", "Bmw", "Ferrari", "Tata"],
    "Person" : ["Alex", "Box", "Carl", "Dex", "Elf", "Fox"],
    "Sales" : [100, 230, 400, 450, 360, 544]
}

In [4]:
df = pd.DataFrame(data)

In [5]:
group_by_company = df.groupby("Companies")
group_by_company

In [6]:
group_by_company.sum()

            Person  Sales
Companies
Bmw        AlexDex    550
Ferrari     BoxElf    590
Tata       CarlFox    944

In [7]:
group_by_company.describe()

          Sales
          count   mean         std    min    25%    50%    75%    max
Companies
Bmw         2.0  275.0  247.487373  100.0  187.5  275.0  362.5  450.0
Ferrari     2.0  295.0   91.923882  230.0  262.5  295.0  327.5  360.0
Tata        2.0  472.0  101.823376  400.0  436.0  472.0  508.0  544.0

In [13]:
group_by_company.sum().drop("Person", axis = 1).loc["Tata"]

Sales    944
Name: Tata, dtype: int64

In [14]:
group_by_company.describe().transpose()

Companies           Bmw     Ferrari        Tata
Sales count    2.000000    2.000000    2.000000
      mean   275.000000  295.000000  472.000000
      std    247.487373   91.923882  101.823376
      min    100.000000  230.000000  400.000000
      25%    187.500000  262.500000  436.000000
      50%    275.000000  295.000000  472.000000
      75%    362.500000  327.500000  508.000000
      max    450.000000  360.000000  544.000000